name: "GNN4Tracking"
platform: "pytorch_libtorch"
max_batch_size: 0
input [
  {
    name: "x__0"
    data_type: TYPE_FP32
    dims: [ -1, 3 ]
  },
  {
    name: "edge_index__1"
    data_type: TYPE_INT64
    dims: [ 2, -1 ]
  },
  {
    name: "edge_attr__2"
    data_type: TYPE_FP32
    dims: [ -1, 4 ]
  }
]
output [
  {
    name: "logits__0"
    data_type: TYPE_FP32
    dims: [ -1, 1]
  }
]
